// методы массивов
// что такое массив?
// lenght - масивтин ичиндеги элементтердин саны
// push - массивтин аягына элемент кошот
// pop - масивдин аягынан элементти алып салат

let arr = [1, 2, 3, 4, 9];
//         0  1  2  3  4

arr.push(10);
arr.pop()

arr.unshift(0); // массивтин башына элемент кошот
arr.shift(); // массивтин башынан элементти алып салат

arr.splice(1, 2); // массивтин ичиндеги элементтерди алып салат (1 - баштапкы индекс, 2 - канча элементти алып салуу керектиги)

arr.splice(1, 0, 5, 6); // массивтин ичиндеги элементтерди кошот (1 - баштапкы индекс, 0 - канча элементти алып салуу керектиги, 5, 6 - кошулуучу элементтер)

arr.reverse(); // массивтин ичиндеги элементтерди тескери кылат

console.log(arr);
console.log(arr.length);
console.log(arr.reduce((acc, curr) => acc + curr, 0)); // массивтин ичиндеги элементтердин суммасын чыгарат


const doubled = arr.map((num) => num * 2);
console.log(doubled);

const evens = arr.filter((num) => num % 2 === 0);
console.log(evens);

console.log(arr[0]); // массивтин биринчи элементин чыгарат